MCTRACO/tellotalent_arduino_package/tellotalent/telloesp32/variants/fireBeetleMesh/pins_arduino.h
#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <stdint.h>

#define EXTERNAL_NUM_INTERRUPTS 16
#define NUM_DIGITAL_PINS        40
#define NUM_ANALOG_INPUTS       16

#define analogInputToDigitalPin(p)  (((p)<20)?(esp32_adc2gpio[(p)]):-1)
#define digitalPinToInterrupt(p)    (((p)<40)?(p):-1)
#define digitalPinHasPWM(p)         (p < 34)

static const uint8_t TX = 1;
static const uint8_t RX = 3;

static const uint8_t SDA = 18;
static const uint8_t SCL = 23;

static const uint8_t SS    = 5;
static const uint8_t MOSI  = 12;
static const uint8_t MISO  = 39;
static const uint8_t SCK   = 14;


#endif /* Pins_Arduino_h */
